Revit 2026 API
Document.NewFlexDuct Method
Overload List
Name | Description
NewFlexDuct(IList<XYZ>, FlexDuctType)
NewFlexDuct(Connector, Connector, FlexDuctType) | Adds a new flexible duct into the document, using two connector, and duct type.
NewFlexDuct(Connector, IList<XYZ>, FlexDuctType)
Top
See Also
Reference
Document Class
Autodesk.Revit.Creation Namespace